{
  "Ramp": "Accelerates mana production beyond the normal one land per turn.",
  "Mana Dork": "A form of Ramp using a creature that produces mana.",
  "Mana Rock": "A form of Ramp using an artifact that produces mana.",
  "Land Ramp": "A form of Ramp that puts land cards from the library directly onto the battlefield.",
  "Ritual": "A form of Ramp that provides a one-time, temporary burst of mana from a non-permanent spell.",
  "Cost Reduction": "A form of Ramp that uses a static effect to make spells cheaper to cast.",
  "Mana Doubler": "A form of Ramp using an effect that causes permanents to produce twice as much mana.",
  "Treasure / Powerstone Generation": "A form of Ramp that creates temporary, one-use mana sources.",
  "Land Search / Fixing": "Searches the library for a land card and puts it into hand, ensuring consistent mana.",
  "Extra Turns": "Grants the player an additional turn, providing a significant tempo and resource advantage.",
  "Card Advantage": "Any effect that results in a net increase of cards available to a player.",
  "Card Draw": "A form of Card Advantage by drawing one or more cards from the library.",
  "Cantrip": "A form of Card Advantage from a cheap spell that draws a single card, replacing itself.",
  "Tutor": "A form of Card Advantage by searching the library for a specific card.",
  "Looting": "A form of Card Selection by drawing a card, then discarding a card.",
  "Rummaging": "A form of Card Selection by discarding a card, then drawing a card.",
  "Impulsive Draw": "A form of Card Advantage by exiling cards from the library that are playable for a limited time.",
  "Scry / Surveil / Top-Deck Manipulation": "A form of Card Selection by looking at and/or rearranging the top cards of the library.",
  "Lifegain": "An effect that increases your life total.",
  "Lifeloss / Drain": "An effect that causes direct life loss, often while gaining you life.",
  "Anthem": "A continuous global boost to your creatures' power and/or toughness.",
  "Lord": "A creature that provides an anthem effect, typically for a specific creature type.",
  "Pump Spell": "A temporary, one-shot boost to a creature's power and/or toughness.",
  "+1/+1 Counters": "Permanently increases a creature's stats with counters.",
  "Auras / Equipment": "Permanents that attach to a creature to grant it new abilities or stats.",
  "Voltron": "A strategy of enhancing a single creature with Auras and/or Equipment to make it the primary threat.",
  "Token Generation": "Creates one or more creature tokens.",
  "Finisher / Beater": "A large or highly effective creature intended to win the game through combat.",
  "Evasion": "An ability that makes a creature difficult to block, such as flying, trample, or menace.",
  "Haste": "Allows a creature to ignore 'summoning sickness' and attack or use abilities the turn it enters the battlefield.",
  "First Strike / Double Strike": "Deals combat damage before other creatures.",
  "Deathtouch": "Any amount of damage this deals to a creature is enough to destroy it.",
  "Trample": "Assigns excess combat damage to the defending player or planeswalker.",
  "Vigilance": "Allows a creature to attack without tapping.",
  "Forced Combat / Goad": "Forces an opponent's creatures to attack, often preventing them from attacking you.",
  "Single-Target Removal": "A spell or ability that neutralizes one permanent.",
  "Board Wipe / Sweeper": "Destroys or exiles all permanents of a specific type, such as all creatures.",
  "Exile Removal": "Removes a permanent from the game entirely, bypassing the graveyard.",
  "Bounce": "Returns a permanent from the battlefield to its owner's hand.",
  "Pacifism / Arrest Effect": "An effect that neutralizes a permanent by preventing it from attacking or using abilities, without removing it from the battlefield.",
  "Forced Sacrifice / Edict": "An effect that forces a player to sacrifice a permanent, getting around protection like hexproof or indestructible.",
  "Fight / Bite": "An effect that forces two creatures to deal damage to each other outside of the normal combat phase.",
  "Counterspell": "Prevents a spell from resolving while it is on the stack.",
  "Hard Counter": "A type of Counterspell that unconditionally counters a spell without exception.",
  "Soft Counter / Taxing Counter": "A type of Counterspell that counters a spell unless a specified amount of mana is paid.",
  "Discard": "Forces an opponent to discard cards from their hand, reducing their resources.",
  "Land Destruction": "Destroys a land permanent, disrupting an opponent's mana base.",
  "Mill": "Puts cards from a player's library directly into their graveyard.",
  "Graveyard Hate": "Exiles cards from a graveyard or otherwise removes it as a resource.",
  "Stax / Tax": "An effect that adds cost or rules to hinder opponents' actions, slowing down the game.",
  "Hatebear": "A small, efficient creature with a Stax-like ability that disrupts opponents' strategies.",
  "Lock / Prison": "An effect that prevents players from performing one or more fundamental game actions, such as casting spells or attacking.",
  "Recursion": "The act of returning cards from the graveyard to another zone like the hand or battlefield.",
  "Reanimation": "A form of Recursion that puts a creature card from a graveyard directly onto the battlefield.",
  "Regrowth": "A form of Recursion that returns a card from the graveyard to its owner's hand.",
  "Flashback / Jump-start / Aftermath etc.": "An ability allowing a spell to be cast from the graveyard, providing value from a different zone.",
  "Self-Mill": "Intentionally putting cards from your own library into your graveyard to enable graveyard-based strategies.",
  "Entomb": "Searches the library for a card and puts it directly into the graveyard.",
  "Graveyard Value": "A card that becomes more powerful or provides benefits based on the number or type of cards in one or more graveyards.",
  "Alternate Win-Con": "A card that provides a 'you win the game' condition outside of reducing an opponent's life total to zero.",
  "Burn": "Spells that deal direct damage to a player's life total or to a planeswalker.",
  "Combo Piece": "A card whose primary function is to enable a specific, powerful, often game-winning interaction with other cards.",
  "Tribal Synergy": "A card that specifically interacts with, buffs, or relies on a certain creature type (e.g., Elves, Goblins, Zombies).",
  "Spellslinger": "A card that provides benefits for casting instant or sorcery spells.",
  "Aristocrats": "An effect that creates value, such as life loss for opponents or card draw for you, from your own permanents being sacrificed or destroyed.",
  "Blink / Flicker": "An effect that exiles a permanent you control and then immediately returns it to the battlefield, often to re-trigger its enter-the-battlefield abilities.",
  "Copy": "An effect that creates a token copy of a permanent or a copy of a spell on the stack.",
  "Group Hug": "Effects that provide resources or benefits to all players in the game, not just yourself.",
  "Group Slug": "Effects that deal damage or cause life loss to all players simultaneously to accelerate the game's conclusion.",
  "Sacrifice Outlet": "A permanent that allows you to sacrifice other permanents for an effect, typically at no mana cost and at instant speed.",
  "Protection": "Abilities that grant immunity from being targeted, damaged, blocked, or enchanted by certain types of spells or permanents."
}
